[
    {
        "id": "jan",
        "cover": "game-journal-img/darksouls3.jpg",
        "title": "Dark Souls III",
        "studio": "FromSoftware",
        "rating": 5,
        "review": "Dark Souls III holds a special place in my heart. I love the game very much but due to the amount of times I insist upon restarting I still haven't finished it, maybe this year is the year. Regardless I love this game play it if you like games that are punishing. ",
        "amendment": "AMENDMENT 5/22/24: I beat the game in April! Despite considering it one of my favorite games ever, I had never finished it! Now I have I can say now it is my favorite game ever and I plan on going back to 100% it.",
        "finished": "Yes",
        "playedbefore": "Yes",
        "monthsplayed": "Jan, Apr",
        "genre": "Action role-play"
    },
    {
        "id": "",
        "cover": "game-journal-img/NTSC_Resident_Evil_2_Cover.png",
        "title": "Resident Evil 2 (1998)",
        "studio": "Capcom",
        "rating": 4,
        "review": "When I was younger I tried playing this game but the fixed camera angles proved too alien for me to master. As an adult coming back to it I've found that all it takes is a change of mindset. I think it is fun, like most games from this era incredibly difficult especially if you've been pampered like me by gentle game design in recent years. The music is also so cool.",
        "finished": "No",
        "playedbefore": "No",
        "monthsplayed": "Jan",
        "genre": "Survival horror"
    },
    {
        "id": "",
        "cover": "game-journal-img/fortnite.jpg",
        "title": "Fortnite",
        "studio": "Epic games",
        "rating": 3.5,
        "review": "Perhaps it is controversial but I love Fortnite. While I am capable of recognizing the negative implications of games as a service, and \"micro\"transactions, I still enjoy this game. It is very fun and always fresh with content, pretty much how I relax after work/school at this point.",
        "finished": "N/A",
        "playedbefore": "Yes",
        "monthsplayed": "Jan - Aug",
        "genre": "Battle royale"
    },
    {
        "id": "",
        "cover": "game-journal-img/Elden_Ring_Box_art.jpg",
        "title": "Elden Ring",
        "studio": "FromSoftware",
        "rating": 5,
        "review": "Elden ring is so good. Just like Dark Souls in its brutal punishing nature but also so fresh and fun. Discovering things in this game for the first time and not knowing what comes next is a genuine treat. ",
        "amendment": "AMENDMENT 5/28/2024: I have finally acquired 100% of the acheivements for this game, marking the first FromSoft game that I will 100% and one of few games that i've ever 100%. ",
        "finished": "3x times",
        "playedbefore": "Yes",
        "monthsplayed": "Jan, Apr-Jul",
        "genre": "Action role-play"
    },
    {
        "id": "feb",
        "cover": "game-journal-img/metal-gear-solid-v-the-phantom-pain-cover-i26603.jpg",
        "title": "Metal Gear Solid V: The Phantom Pain",
        "studio": "Kojima Productions",
        "rating": 4,
        "review": "I came back to this game this year because of the recent Metal Gear resurgance I have been victim of online. I really find this game fun, while that can be controversial I think that this game is fun for what it is and I think little about what it could have been. It certainly lacks some of the spark that the other games in the series have, but I think its good in a different way.",
        "finished": "No",
        "playedbefore": "Yes",
        "monthsplayed": "Feb-Mar",
        "genre": "Action-adventure stealth"
    },
    {
        "id": "",
        "cover": "game-journal-img/metal-gear-solid-3-snake-eater.jpg",
        "title": "Metal Gear Solid 3: Snake Eater",
        "studio": "Konami",
        "rating": 5,
        "review": "I am actually shocked that I beat this game, I am so bad when it comes to committing to a full playthough of a game. I had a lot of fun with it.",
        "finished": "Yes",
        "playedbefore": "Yes",
        "monthsplayed": "Feb-Mar",
        "genre": "Action-adventure stealth"
    },
    {
        "id": "",
        "cover": "game-journal-img/Metal_Gear_Solid_cover_art.png",
        "title": "Metal Gear Solid",
        "studio": "Konami",
        "rating": 4,
        "review": "I am not terribly far along in this game but I enjoy it so far. I am on a bit of a Metal Gear Kick",
        "finished": "No",
        "playedbefore": "No",
        "monthsplayed": "Feb-Mar",
        "genre": "Action-adventure stealth"
    },
    {
        "id": "",
        "cover": "game-journal-img/minecraft.png",
        "title": "Minecraft",
        "studio": "Mojang",
        "rating": 5,
        "review": "One of my favorite games ever. Another game that has been catching a lot of negative critisism as of late, but it brings me a lot of comfort and joy.",
        "finished": "Yes",
        "playedbefore": "Yes",
        "monthsplayed": "Feb, Jun-Jul",
        "genre": "Survival sandbox"
    },
    {
        "id": "mar",
        "cover": "game-journal-img/noita.jpg",
        "title": "Noita",
        "studio": "Nolla games",
        "rating": 4.5,
        "review": "Noita is so good. Very difficult yet rewarding. It begs for you to try and exploit the games mechanics to your advantage. Super fun.",
        "finished": "No",
        "playedbefore": "Yes",
        "monthsplayed": "Mar",
        "genre": "Roguelite"
    },
    {
        "id": "",
        "cover": "game-journal-img/FTL.png",
        "title": "FTL",
        "studio": "Subset Games",
        "rating": 4,
        "review": "Good, fun, simple yet complicated. I come back to this one every once in a while.",
        "finished": "No",
        "playedbefore": "Yes",
        "monthsplayed": "Mar",
        "genre": "Roguelike"
    },
    {
        "id": "apr",
        "cover": "game-journal-img/stray.jpg",
        "title": "Stray",
        "studio": "BlueTwelve",
        "rating": 5,
        "review": "I came into this game with low expectations, after all the discourse since it's release have painted it as 'boring' or 'too short'. Implying that it wasn't worth the money, even at a discount. However I love this game. I was very impressed not only with the environments and world but most of all with the animation of the cat. Call me a cat lover to a fault but I couldn't believe the attention to detail. The gameplay is also super satisfying, whenever I wanted to jump on something or do something I was seldom stopped in my tracks by the game's mechanics.",
        "finished": "No",
        "playedbefore": "No",
        "monthsplayed": "Apr",
        "genre": "Indie adventure"
    },
    {
        "id": "",
        "cover": "game-journal-img/re3.jpg",
        "title": "Resident Evil 3 (2020)",
        "studio": "Capcom",
        "rating": 3.5,
        "review": "I must say that despite the 3.5 star review I quite like this game. The problem lies in how this game, while fun in my eyes, is the epidome of wasted potential. RE2 remake is my favorite game ever and it set a very high precedent for what they were capable of doing with the RE remakes. However with this game not only is it lacking the polish and care but it is quite a bit shorter than the other. The fact that you can reletively easily beat this game in under 3 hours is proof of this. RE2 excels at tension by having a big monster follow you around for the whole latter half of the game, making the already difficult and challenging puzzles and layout become even more stressful. So when this game has the potential to take that concept and amplify it it, it doesnt. Instead of having nemesis follow you over a big and open area, it opts to have you on a glorified hallway for one short moment of the game. ",
        "finished": "3+ times",
        "playedbefore": "Yes",
        "monthsplayed": "Apr",
        "genre": "Action survival horror"
    },
    {
        "id": "",
        "cover": "game-journal-img/marvelsspiderman2_lob_crd_02.jpg",
        "title": "SpiderMan 2",
        "studio": "Sony Interactive",
        "rating": 3,
        "review": "I haven't gotten a chance to make it extremely far in this game yet but I was very impressed with it, it has still yet to prove itself as really great however.",
        "finished": "No",
        "playedbefore": "No",
        "monthsplayed": "Apr",
        "genre": "Action adventure"
    },
    {
        "id": "",
        "cover": "game-journal-img/Fallout_4_cover_art.jpg",
        "title": "Fallout 4",
        "studio": "Bethesda",
        "rating": 1.5,
        "review": "For a long time I considered this one of my favorite games and I came very close getting 100% completion. However coming back to it (before the show came out suprisingly) I discovered that it was in fact, bad. Like very difficult to force myself to play bad. ",
        "finished": "Yes",
        "playedbefore": "Yes",
        "monthsplayed": "Apr",
        "genre": "Action role-play, Post-Apocalyptic."
    },
    {
        "id": "apr",
        "cover": "game-journal-img/Bloodborne_Cover_Wallpaper.jpg",
        "title": "Bloodborne",
        "studio": "FromSoftware",
        "rating": 0,
        "review": "N/A havenet played enough yet",
        "finished": "No",
        "playedbefore": "No",
        "monthsplayed": "Apr-Jun",
        "genre": "Gothic horror"
    },
    {
        "id": "",
        "cover": "game-journal-img/MassEffect.jpg",
        "title": "Mass Effect",
        "studio": "EA",
        "rating": 0,
        "review": "N/A havenet played enough yet",
        "finished": "No",
        "playedbefore": "No",
        "monthsplayed": "Apr",
        "genre": "Military science fiction"
    },
    {
        "id": "may",
        "cover": "game-journal-img/darksouls1.jpg",
        "title": "Dark Souls Remastered",
        "studio": "FromSoftware",
        "rating": 4,
        "review": "I am torn between a 3.5 and a 4 star rating, however I think my enjoyment of the franchise and the addictiveness of these games elevates it a little bit higher. There are parts of this game that are honestly so frustrating it brings me close to turning it off and walking away. Out of all the fromSoftware games i've played this one has tested my patience the most. Nevertheless my goal is to 100% all of these games, Elden Ring, Dark Souls I, II, and III, Sekiro, and Bloodborne. We will certainly see if I am even capable of that at this rate... ",
        "finished": "No",
        "playedbefore": "Yes",
        "monthsplayed": "Apr-Jun",
        "genre": "Action role-play"
    },
    {
        "id": "jul",
        "cover": "game-journal-img/dbd.jpg",
        "title": "Dead By Daylight",
        "studio": "Behaviour Interactive",
        "rating": 4,
        "review": "Dead by Daylight is a game that I have been playing off and on since 2017. The thing that usually draws me back is the approach of fall. If you know anything about it it's that I am very enthusiastic about Halloween and fall. This game has it's flaws but I still love it. I think the rating may go up as I play it more this year. ",
        "amendment": "AMENDMENT 8/12/2024: I have been playing an unhealthy amount of this game since they enabled cross progression. I love this game, I am increasing the rating from 3.5 to 4",
        "finished": "N/A",
        "playedbefore": "Yes",
        "monthsplayed": "Jul-Nov",
        "genre": "asymmetric multiplayer, survival horror"
    },
    {
        "id": "oct",
        "cover": "game-journal-img/silenthill2re.jpg",
        "title": "Silent Hill 2 (2024)",
        "studio": "Bloober Team",
        "rating": 5,
        "review": "I am in love with this game. The presentation and care that went into it bleed straight through. Highly recommend this game to anyone who likes appreciating a virtual environment! This game has also gotten some real scares out of me. ",
        "finished": "N/A",
        "playedbefore": "No",
        "monthsplayed": "Oct",
        "genre": "Survival Horror"
    }
]
