[
    {
        "id": "jan",
        "cover": "movie-journal-img/61zFh8+gdrL.jpg",
        "title": "The Lighthouse",
        "director": "Robert Eggers",
        "rating": 5,
        "review": "I really enjoyed this movie. I watched it originally in 2023 during a horror movie kick and really enjoyed it. This year I had the opritunity of showing it to two more friends who hadn't seen it yet. Watching it a second time to see their thoughts on what was going on was very worth while. The plot sounds like a recipe for failure, its a movie in black and white with only two characters interacting in one places for the whole film. That sounds so boring but in execution it is incredible. Psycologically and cinematically it is very good at keeping you gripped. It is no feel good movie so keep that in mind if you decide to watch it.",
        "duration": 110,
        "genre": "Psychological thriller",
        "dateWatched": "1/XX/2024"
    },
    {
        "id": "mar",
        "cover": "movie-journal-img/MicrosoftTeams-image-2-1.jpg",
        "title": "The Batman",
        "director": "Matt Reeves",
        "rating": 3.5,
        "review": "While I wouldn't classify this movie as high art or anything like that, it was very entertaining. I liked what they were going for and how this is an actual movie. Too many big budget films focus on being only part of a whole whereas this film feels like it is complete, no need for many films worth of context.",
        "duration": 175,
        "genre": "Action, thriller",
        "dateWatched": "3/XX/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/51XFaesw92L._AC_UF894,1000_QL80_.jpg",
        "title": "The End of Evangelion",
        "director": "Anno and Kazuya Tsurumaki",
        "rating": 5,
        "review": "My friend and I finished the original Neon Genesis Evangelion tv show at the start of this year. We knew of the fact that movies existed but made little effort to seek them out. However the perfect oppritunity arose when for the first time ever this film was released in theaters in the US, it was released originally in 1997. That being said, this was my first movie theater experience of the year and I feel like I gained back some love for theaters in the process. The original TV show focused in on heavier tones and plot points meant to shock you at times it was nowhere near as gruesome, shocking, and violent as this movie was. I was in awe as the tone was completely different and the movie was incredibly heavy. I was speechless at the end it was like a nightmare. Overall I very much enjoyed the movie and I am interested to see how my outlook on it develops with time.",
        "duration": 90,
        "genre": "Apocalyptic science fiction",
        "dateWatched": "3/17/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/eva1.jpg",
        "title": "Evangelion: 1.0 <br>You Are (Not) Alone",
        "director": "Anno and <br>Kazuya Tsurumaki",
        "rating": 1.5,
        "review": "Uh...",
        "duration": 98,
        "genre": "Science fiction, Action",
        "dateWatched": "3/23/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/eva2.jpg",
        "title": "EVANGELION:2.22 <br>YOU CAN (NOT) ADVANCE.",
        "director": "Anno and <br>Kazuya Tsurumaki",
        "rating": 2,
        "review": "Has more merit than Evangelion 1.0, animation is good but lacks the intrigue of the original. I am on a bit of a movie marathon... The previous movie I finished at midnight and here I am again watching more.",
        "duration": 108,
        "genre": "Science fiction, Action",
        "dateWatched": "3/23/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/eva3.jpg",
        "title": "EVANGELION:3.33 <br>YOU CAN (NOT) REDO.",
        "director": "Anno and <br>Kazuya Tsurumaki",
        "rating": 2,
        "review": "The visuals and artistic direction were very impressive. While this movie was another step up I feel like it lacked a lot of things for me. That being said I enjoyed how drastically different things are from the orginal show and movie.",
        "duration": 96,
        "genre": "Apocalyptic science fiction",
        "dateWatched": "3/23/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/eva3+1.jpg",
        "title": "Evangelion: 3.0+1.0 Thrice Upon a Time",
        "director": "Anno and <br>Kazuya Tsurumaki",
        "rating": 4.5,
        "review": "A return to form. I was very impressed with the quality and polish in this one. Not perfect but it made statements and was the culmination of mountains of talent and care. Very emotional and incredibly reserved portions of this movie. Easily one of the best Evangelion related pieces of media. It was nice seeing a happy ending for a change too. This series is very bleak, one of the most notable things about the orignial 'End of Evangelion' movie was how bleak it was. Its impressive how this movie mananged to keep the heaviness without sacrificing a feel-good ending ",
        "duration": 155,
        "genre": "Science fiction, Action",
        "dateWatched": "3/24/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/yourname.jpg",
        "title": "Your Name",
        "director": "<br>Makoto Shinkai",
        "rating": 4.5,
        "review": "This is one of those movies that I have seen recommended about 1000 times, especially when it came out. But I had never heard a good enough appraisal to sit down and watch it. I only ended up seeing it because my roomates were watching it. I can see why there was so much hype. It's incredibly high quality on all fronts and was really intriguing too. I always avoid romance because it tends to be formulaic in a way I find boring, but this movie has opened my eyes to the fact that I was generalizing too much!",
        "duration": 112,
        "genre": "Romance, Drama",
        "dateWatched": "3/28/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/midsommar.jpg",
        "title": "Midsommar",
        "director": "<br>Ari Aster",
        "rating": 5,
        "review": "I watched this movie once before after watching Heriditary, another film by Ari Aster. Heriditary is one of my favorite movies and I went into this film orginally with high expectations and was not disappointed. In recent times however i've discovered that opinions on this movie are more of a mixed bag. I saw people online whom I knew calling this film bad, bland, cheap and I was suprised because that was not my appraisal at all. Generally when it comes to movies my opinions tend to align very closely with the general opinion on them. This always made me feel as though my taste in movies was basic. But suprisingly on a second watch with more critical thinking, I still enjoyed it a lot.",
        "duration": 148,
        "genre": "Horror, Drama",
        "dateWatched": "3/30/2024"
    },
    {
        "id": "apr",
        "cover": "movie-journal-img/suzume.jpg",
        "title": "Suzume",
        "director": "<br>Makoto Shinkai",
        "rating": 4.5,
        "review": "Such impressive visuals, certainly makes the whole movie worth watching alone. The music is also really good, together they make a very mesmerizing movie. Overall it was very good! Overall I dont have a lot to say which is either a good or bad thing depending on the movie.",
        "duration": 122,
        "genre": "Adventure, mystery",
        "dateWatched": "4/6/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/weather.jpg",
        "title": "Weathering with you",
        "director": "<br>Makoto Shinkai",
        "rating": 4,
        "review": "This movie was really good, it just seemed a tad confused. I never was able to catch the underlying ideas that this film had, it almost seems completely surface level, but now and again it seems to sugest some deeper subtext. ",
        "duration": 114,
        "genre": "Fantasy",
        "dateWatched": "4/8/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/ape.jpg",
        "title": "Rise of the Planet<br>of the Apes",
        "director": "<br>Rupert Wyatt",
        "rating": 2.5,
        "review": "We watched this movie because my roommate is a big fan of the franchise. I had seen this movie originally sometime back when it came out but I was like ~11 so I dont really remember my opinions on it. Honesly my highest praise is that it was entertaining, not once did I really stop paying attention. Otherwise, it was alright I have nothing to bad or good to say.",
        "duration": 105,
        "genre": "Action, Science Fiction",
        "dateWatched": "4/10/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/dawn.jpg",
        "title": "Dawn of the Planet<br>of the Apes",
        "director": "<br>Matt Reeves",
        "rating": 2.5,
        "review": "It was alright, I can see why it might have more merit than the previous film but in my mind I cant fathom a single reason I would raise it above 2.5 stars.",
        "duration": 130,
        "genre": "Action, Adventure",
        "dateWatched": "4/13/2024"
    },
    {
        "id": "",
        "cover": "movie-journal-img/war.jpg",
        "title": "War for the Planet<br>of the Apes",
        "director": "<br>Matt Reeves",
        "rating": 2.5,
        "review": "This was kind of ridiculous. I know I shouldn't expect anything less of a movie about apes gaining human sentience, but this movie took itself so seriously. There were enjoyable parts but it is oddly doused in cliches and it doesn't seem to have an ounce of self awareness about it. Why do they have massive tanks of combustible fluids right next to their front gates when their enemies have rockets and jets??",
        "duration": 140,
        "genre": "Action, Science Fiction",
        "dateWatched": "4/17/2024"
    },
    {
        "id": "may",
        "cover": "movie-journal-img/monkeykingdom.jpg",
        "title": "Kingdom of the Planet<br>of the Apes",
        "director": "<br>Wes Ball",
        "rating": 3,
        "review": "I am often scewed in my movie opinions when I watch the movie in theaters, which could possibly explain why I feel compelled to give this movie a 3 where the other movies all got a 2.5. It was alright, I walked out feeling positve about it but I don't have all that much to say.",
        "duration": 145,
        "genre": "Action, Science Fiction",
        "dateWatched": "5/18/2024"
    },
    {
        "id": "jul",
        "cover": "../../blogs/anime-ranking/anime-covers/jjk0.jpg",
        "title": "Jujutsu Kaisen 0",
        "director": "<br>Gege Akutami",
        "rating": 3,
        "review": "It was always strange to me how exactly this fits into the wider story. Like here is a prequel story that is crucial to fully understanding season 2 of the show but doesn't really fit all that well. Why does this show need two main characters? It's an entertaining movie at least.",
        "duration": 105,
        "genre": "Action, Triller, Anime",
        "dateWatched": "7/19/2024"
    },
    {
        "id": "aug",
        "cover": "movie-journal-img/alien.jpg",
        "title": "Alien",
        "director": "",
        "rating": 4,
        "review": "",
        "duration": 0,
        "genre": "",
        "dateWatched": "7/29/2024"
    },
    {
        "id": "sep",
        "cover": "movie-journal-img/elcamino.jpg",
        "title": "El Camino",
        "director": "<br>Vince Gilligan",
        "rating": 2.5,
        "review": "",
        "duration": 122,
        "genre": "Action, Drama",
        "dateWatched": "8/25/2024"
    },
    {
        "id": "oct",
        "cover": "../../blogs/anime-ranking/anime-covers/lookback.jpg",
        "title": "Look Back",
        "director": "<br>Kiyotaka Oshiyama",
        "rating": 5,
        "review": "Incredible film. It was only earlier this year when I read look back for the first time and it is hard to beleive that something so good can be adapted into a different medium with so much care and passion. Every part of this movie is made with care and love, I highly recommend it for anyone who loves art!",
        "duration": 57,
        "genre": "Coming-of-age",
        "dateWatched": "10/7/2024"
    }
]