[
    {
        "id": "jan",
        "cover": "tv-journal-img/evangelion.jpg",
        "title": "Neon Genesis Evangelion",
        "creator": "Hideaki Anno",
        "rating": 4.5,
        "review": "This show is very artistically rich. I really like learning about the world and characters. However it falls into some typical anime tropes that I don't really like. It can go from being masterful in one episode to just uncomforatble or bland on the next but generally keeps a good overall quality. The last two episodes weren't the best in my eyes but they are retconned by the movie so I dont really consider them when looking at the storys end. Overall I recommend it but only to those with open minds.",
        "amendment": "Amendment 8/12/2024: I ordered a bluray and rewatched this during the end of July to the start of August. My roommate and partner had never seen it before and I thought it would be fun to watch it again with them and get their opinion. What shocked me was how much more I enjoyed it on a second watch. Almost all of the issues I had before were completely null and void. I saw a new layer of commentary and self-awareness that I had mistaken for cliche before. I am raising the rating from 4 to 4.5 stars!",
        "duration": "26 episodes",
        "genre": "Apocalyptic, mecha, psycological",
        "dateWatched": "1/2/2024"
    },
    {
        "id": "",
        "cover": "tv-journal-img/flowers-of-evil.jpg",
        "title": "Flowers of Evil",
        "creator": "Atsushi Moriyama",
        "rating": 4.5,
        "review": "When we started watching this show I was startled by the animation. It is rotoscoped, I think, completely all character movement is clearly outlined animation of a real person and it looks really funky. To the show's credit I really like how it looks, and the wonkiness provides an uncomfortable feeling that matches the show perfectly. In fact the whole show was extremely uncomfortable but that was clearly by design. My one big gripe is the nonsense ending. I love media that is unclear, or up to interpretation, but this felt a little to much like a slideshow saing \"Oops! we ran out of time/money.\" Overall I think people who want something unique should try it.",
        "duration": "13 episodes",
        "genre": "Coming-of-age, psycological",
        "dateWatched": "1/XX/2024"
    },
    {
        "id": "feb",
        "cover": "tv-journal-img/hells-paradise.jpg",
        "title": "Hells Paradise Season 1",
        "creator": "Kaori makita",
        "rating": 2,
        "review": "Its kind of embarrising to me that it is mostly animation on this list but its what I watch with my roomates and I do not watch TV or movies on my own apparently. Anyways, I didn't really care for this very much. Felt souless at times and was often carried by the design or art, when that was lacking, a 20 minute episode could feel like an hour. I enjoyed the main character's development emotionally but that was not enough to carry it above a 2 star ratting.",
        "duration": "13 episodes",
        "genre": "Action, dark fantasy",
        "dateWatched": "2/XX/2024"
    },
    {
        "id": "apr",
        "cover": "tv-journal-img/smiling_friends.jpg",
        "title": "Smiling Friends season 1",
        "creator": "Zach Hadel, <br>and Micheal Cusack",
        "rating": 5,
        "review": "Smiling friends is one of my favorite shows and I recently decided to rewatch it in preperation for the new season soon. The show is only about 100 minutes total accross all episodes but there is somehow so so much thats going on here. I highly recommend as its creativity and artistry is nearly unrivaled in currently running TV. Be warned that the title of 'surreal humour' does not come for free and its not for everybody. My roommates hate it!",
        "duration": "9 Episodes",
        "genre": "Surreal humour",
        "dateWatched": "4/3/2024"
    },
    {
        "id": "",
        "cover": "tv-journal-img/attack_on_titan.jpg",
        "title": "Attack On Titan season 1",
        "creator": "Hajime Isayama",
        "rating": 4.5,
        "review": "I first watched this in 2013 in it's original airing period. I then watched it again in 2020 during the Covid-19 lockdowns and then once more in 2021-2022 with my partner who had never seen it before. So rewatching it now gave me a strong sense of nostalgia. I am rewatching it now because my roommate had never watched it and my partner was eager to start fresh to understand the last season. Overall its incredible, of couse it has cliche moments and occasionally relies on its violence, but it barely takes away from the high quality of the show. ",
        "duration": "25 Episodes",
        "genre": "Action Dark fantasy <br>Post-apocalyptic",
        "dateWatched": "4/1/2024"
    },
    {
        "id": "",
        "cover": "tv-journal-img/aot2.jpg",
        "title": "Attack On Titan season 2",
        "creator": "Hajime Isayama",
        "rating": 4.5,
        "review": "Season 2 was very good, for some reason I didn't care for it very much back when it first released but now I do. Of course watching it with someone who had never seen it was a contributing factor.",
        "duration": "12 Episodes",
        "genre": "Action Dark fantasy <br>Post-apocalyptic",
        "dateWatched": "4/6/2024"
    },
    {
        "id": "",
        "cover": "tv-journal-img/aot3.jpg",
        "title": "Attack On Titan season 3",
        "creator": "Hajime Isayama",
        "rating": 4.5,
        "review": "It's hard to sell this show to people who haven't seen it before. However it's biggest draw for me is that is it's mystery and intrigue. From the first episode we are given huge mysteries and part of the central conflict of the show is the lack of information that any of the characters have. This season finally gives many of the answers to those questions in an extremely cathartic way. By the last episode of the season we witness a complete shift in the stakes and themes of the show that is controverisal to many people, however you cannot deny how shocking it is. ",
        "duration": "22 Episodes",
        "genre": "Action Dark fantasy <br>Post-apocalyptic",
        "dateWatched": "4/27/2024"
    },
    {
        "id": "may",
        "cover": "tv-journal-img/aot4.jpg",
        "title": "Attack On Titan season 4",
        "creator": "Hajime Isayama",
        "rating": 5,
        "review": "Season 4 is really good. I have already seen it back when it first aired but I went in hesitant to praise it because I have seen a lot of debates online. My opinion remains unchanged however I was really impressed.",
        "duration": "30 Episodes",
        "genre": "Action Dark fantasy",
        "dateWatched": "5/8/2024"
    },
    {
        "id": "",
        "cover": "tv-journal-img/bear.jpg",
        "title": "The Bear season 1",
        "creator": "Christopher Storer",
        "rating": 5,
        "review": "I was skeptical about this show before I watched it. Every clip that I had seen online seemed to be just Jeremy Allen White's character brooding and looking mooding in a chefs outfit but to my suprise the show is actually really good and his character is one that you actually care about. It's a show that is very chaotic and at times will forgo explicit context and do really good about allowing you to learn about the characters and the story before the show without outright telling you. Super good, moving on to season 2!",
        "duration": "8 Episodes",
        "genre": "Comedy-drama",
        "dateWatched": "5/8/2024"
    },
    {
        "id": "jun",
        "cover": "tv-journal-img/chernobyl.jpg",
        "title": "Chernobyl",
        "creator": "Craig Mazin",
        "rating": 4,
        "review": "As a drama I found it very compelling and well made. They make you care about the characters and present the show in a way where even if you know the history it's very enthralling. I can't speak to the historical accuracy but it's clear that they take liberties for the sake of good TV. So if you are able to put that behind you I really recommend it!",
        "duration": "5 Episodes",
        "genre": "Historical drama",
        "dateWatched": "6/2/2024"
    },
    {
        "id": "",
        "cover": "tv-journal-img/smiling_friends_2.jpg",
        "title": "Smiling Friends season 2",
        "creator": "Zach Hadel, <br>and Micheal Cusack",
        "rating": 5,
        "review": "I was worried that the show would be cancelled before getting a season two but I think it has exploded in popularity enough to warrent several more. I love the way that this show is willing to do whatever it wants with the medium of animation.",
        "duration": "8 Episodes",
        "genre": "Surreal humour",
        "dateWatched": "6/23/2024"
    },
    {
        "id": "jul",
        "cover": "tv-journal-img/jjks1.jpg",
        "title": "Jujutsu Kaisen season 1",
        "creator": "Gege Akutami",
        "rating": 3.5,
        "review": "I had already seen this before but my roommate, partner, and I have been showing each other shows and they had not yet seen this one and were curious. I enjoyed it more on a second watch! Sometime though it gets muddled in explaining how it's own power system works and feels like a boring science lesson when someone punches someone else.",
        "duration": 24,
        "genre": "Action, thriller, spiritual",
        "dateWatched": "7/17/2024"
    },
    {
        "id": "",
        "cover": "../anime-ranking//anime-covers/jjk.jpg",
        "title": "Jujutsu Kaisen season 2",
        "creator": "Gege Akutami",
        "rating": 4,
        "review": "Season 2 can only truly be described as a specticle. End to end it gives very good animation and suspense. I am a tad skeptical in the writing, and it is starting to feel like a typical shonen with a darker shade of paint. But overall I really enjoyed it!",
        "duration": 23,
        "genre":"Action, thriller, spiritual",
        "dateWatched": "7/29/2024"
    },
    {
        "id": "aug",
        "cover": "tv-journal-img/ranking.jpg",
        "title": "Ranking of Kings season 1",
        "creator": "Sousuke Touka",
        "rating": 2.5,
        "review": "I Thought It was a fun watch, the animations at times was spectacular and many of the characters are deeply likable. It becomes kind of ridiculous when the show bends over backwards to keep characters from dying despite the very dire situations they are consistantly placed in. The plot also goes completely hairwire at random intervals, people change sides more than 3 times and people very quickly abandon the plot thread that they were following. Episodes will end with a character declaring \"Im going to do this thing!\" and then the next episode it shows that they don't actually want to do that or they never intended too, its like whiplash. ",
        "duration": "23 Episodes",
        "genre": "Fantasy humour",
        "dateWatched": "8/11/2024"
    }
    
]