[
    {
        "id": "jan",
        "cover": "book-journal-img/9780811232432.jpg",
        "title": "No Longer Human",
        "author": "Osamu Dazai",
        "rating": 4.5,
        "review": "This is the first book I read in 2024, it is also what inspired me to try reading more in 2024. The presentation and premise of this book is very interesting, especially with the history of the author in mind. The main character is so miserable at times I almost struggle to feel bad for him. This is a book I can't stop thinking about and I find it really fascinating how it exposed the author's gross feelings on life and other people.",
        "pages": 176,
        "genre": "Fiction",
        "dateRead": "1/2/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/9781101195819.jpg",
        "title": "Kokoro",
        "author": "Natsume Souseki",
        "rating": 5,
        "review": "I really loved this book, it left me very sad for a couple days after finishing it. What I did was search \"books if you liked no longer human\" and this was overwhelmingly the result. I can see why, discussion of suicide, authors final work, parts of the story told in letter form, similar time period, and more. Overall the book does a good job of making you think about what it is that you are living for and what that means for the people around you.",
        "pages": 256,
        "genre": "Fiction",
        "dateRead": "1/5/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/9781421586205_p0_v1_s1200x630.jpg",
        "title": "Goodnight Punpun vol.1",
        "author": "Inio Asano",
        "rating": 4.0,
        "review": "This was my first manga of the year, I had actually ordered this from Amazon during the COVID lockdown and never gotten to fully reading it. I thought it was really good, carried very much by the art but very good story nevertheless. I loved how absolutely wacky and strange the book is overall and I can see some heavy themes that will definitely bloom to fruition over the course of the series.",
        "pages": 448,
        "genre": "Coming-of-age Drama",
        "dateRead": "1/7/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/91F0JwS6-fL._AC_UF1000,1000_QL80_.jpg",
        "title": "Goodnight Punpun vol.2",
        "author": "Inio Asano",
        "rating": 4.5,
        "review": "Volume 2 left me wanting to read more. The heavy themes are more prevalent as we see the main character Punpun get older. We also expand on the story of a couple side-characters and I felt as though those stole the spotlight. I love the mix of wacky art and characters with the heavy themes and plots.",
        "pages": 432,
        "genre": "Coming-of-age Drama",
        "dateRead": "1/8/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/81r9pMwJCoL._AC_UF1000,1000_QL80_.jpg",
        "title": "Look Back",
        "author": "Tatsuki Fujimoto",
        "rating": 5.0,
        "review": "This might be one of my favorite manga that I have ever read. I really loved the art and paneling, it felt like there wasn't much detail that was not deliberate by the author. The story very clearly has a deep connection with the author's own life and their experience with writing and drawing. This was really good!",
        "pages": 144,
        "genre": "Coming-of-age Drama",
        "dateRead": "1/10/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/GUEST_773681c8-e3ac-4069-bea4-3e317df50564.jpg",
        "title": "Web Design in easy steps",
        "author": "Sean McManus",
        "rating": 3.5,
        "review": "I wanted to make this website as a means to showcase my technical ability but unfortunately I was getting bogged down in the details. For instance, good practice, naming and structure conventions, syntax, etc. This book was good at providing me enough support to not have to consult countless internet sources which very often say very different things. Reading the whole way though, it is lacking in some areas and seems to speak in a matter-of-fact way that I think sometimes should be left more open for a first-time learner.",
        "pages": 228,
        "genre": "Reference Work",
        "dateRead": "1/13/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/61WuDamPP8L._AC_UF1000,1000_QL80_.jpg",
        "title": "The Hellbound Heart",
        "author": "Clive Barker",
        "rating": 4.0,
        "review": "I bought this book in 2021 after seeing 'Hellraiser' for the first time. I really enjoyed the concepts that the film presented and wanted to see that possibly fleshed out in the original material. However, I think that while the book is way more consistent in its themes and quality, I'm still wanting to see more detail and nuance. Very nice short reading break from my other current book (<span class = \"house\">House</span> of Leaves), overall I liked it about as much as I thought I would.",
        "pages": 186,
        "genre": "Horror, gothic fiction",
        "dateRead": "1/16/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/house-of-leaves.jpg",
        "title": "<span class = \"house\">House</span> of Leaves",
        "author": "Mark Z. Danielewski",
        "rating": 4.0,
        "review": "Truth be told, I am not much of a reader. This project was made to encourage me to read more and so far has worked towards that goal. However, this book was a huge test. Starting with relatively short books to build my attention span and reading speed, this is the first rather long book I have tried to read. 736 is much more than ~200, on top of its nature as 'ergodic literature,' this was extremely hard to read. However, I did enjoy it, it's a genuinely very finely crafted and unsettling story with a metric ton of deeper meaning laced into every page. Although at times the unconventional way the book is structured, reading compiled transcription of a book written about a movie all layers of which have their own horror, works to take away some of the genuine horror aspects. I found this book because I wanted more 'nightmare-like' horror, that is to say, horror that feels like the disjointed and nonsensical feeling one has in bad dreams. To that end, this book delivers. It also gives me the impression that this book partly inspired the internet-driven obsession with 'liminal spaces' particularly in the beginning when the subject and director of the movie about which this book is written discovers the strange things about their <span class = \"house\">House</span>. So overall I enjoyed this but I have trouble recommending it because of how much effort is involved in reading it.",
        "pages": 736,
        "genre": "Novel, Horror fiction, Ergodic literature",
        "dateRead": "1/21/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/71WDlCXBe0L._AC_UF1000,1000_QL80_.jpg",
        "title": "Fire Punch Vol.1",
        "author": "Tatsuki Fujimoto",
        "rating": 3.5,
        "review": "This is another one of Fujimoto's works, one that I had not gotten around to reading until now. I had thought that maybe since this is one of his earlier works it would be lacking the nuance he shows in his current work. However, after seeing online discourse around this series suggest that is has a lot of deeper meaning and themes I was persuaded to try it. I can certainly see the set-up being constructed to delve into these deeper themes but unfortunately the book doesn't quite dive into them fully, so that's a hope for volume 2. I can tell a huge theme in this is going to be about movies, similar to the themes in <span class = \"house\">House</span> of Leaves, but probably channeled through Fujimoto's passion for cinema. In all, I am excited to see where this goes, the art was really good as usual and Fujimoto's creativity needs to be admired.",
        "pages": 200,
        "genre": "Dark fantasy, Dystopian, Supernatural",
        "dateRead": "1/21/2024"
    },
    {
        "id": "feb",
        "cover": "book-journal-img/81ZhgPj7hyL._AC_UF1000,1000_QL80_.jpg",
        "title": "Chainsawman Vol.14",
        "author": "Tatsuki Fujimoto",
        "rating": 5.0,
        "review": "I debated for a while whether or not to include books like these where I already deep into the series but if I didn't I would only have one book for February lol. Chainsawman is kind of one of my guilty pleasures because not only does it seem like mindless action schlock media on the surface but if you take it for face value it kind of is. However, I think it is actually a masterclass in character and depth if you actually take the time to read it with an open mind because I thought that when I bought it in 2022 because I was sure it would be goofy. As funny as it sounds to have this be one of only three 5-star ratings so far, I legitimately could not justify giving it a lower rating, especially considering this is my own list and its based on personal enjoyment. Seeing the two main characters of the series interact seriously for the first time since the start of 'part two'(volume 12-Ongoing) and having room for connections back to the trauma experienced in part one in a subtle way while developing new characters and stakes is done really well. Not to mention character design and art being good as well, I enjoyed it like I normally do this authors works, especially when you don't pay attention to the type of people the series generally attracts on the internet lol.",
        "pages": 192,
        "genre": "Dark fantasy, Comedy Horror",
        "dateRead": "2/6/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/81nT7nT92LL._AC_UF1000,1000_QL80_.jpg",
        "title": "Fire Punch Vol.2",
        "author": "Tatsuki Fujimoto",
        "rating": 2.5,
        "review": "I am SWAMPED with school right now, I had predicted that I would see a loss in reading throughput due to the school year beginning again but I didn't think this bad. This may be the only book I finish in February which is a bit sad. I am currently reading Natsume Soeseki's 'I am a Cat' and a short story collection of HP Lovecraft at a snail's pace. It was kind of nice being able to have the satisfaction of finishing a book. Either way, this volume was definitely good in the same way that the previous one was. However, I am not loving the shock value throughout this one. It can be said that all of Fujimoto's work has shock value, but until this book, I hadn't really considered what made his other examples of this good and what was icky about this one. One of the big things was that there was very little value, character-wise or thematically from it. Like I can easily see justifications for why he would want to flesh out the dystopian world in that way, but unfortunately, I think it crosses into the gratuitous. While I will be reading the next one(whenever I see it at a store I guess) I wouldn't even recommend the series as a whole. I will hold out my overall judgment until he gets a chance to pay off some of this thematic build-up that the story is working toward though.",
        "pages": 208,
        "genre": "Dark fantasy, Dystopian, Supernatural",
        "dateRead": "2/26/2024"
    },
    {
        "id": "mar",
        "cover": "book-journal-img/71GZt9xMqKL._AC_UF1000,1000_QL80_.jpg",
        "title": "Quartet: Intermediate Japanese Across the Four Language Skills Vol. 1",
        "author": "Akemi Yasui, Yuriko Ide, Miyuki Doi, Hideki Hamada",
        "rating": 4.5,
        "review": "I was in class today and we officially finished this textbook and it occurred to me: 'does this count?' Like where do I draw the line? Originally this part of the blog started as a way for me to keep track of novels and the like. But then I added a reference work and other non-traditional books now I am muddled. Either way I decided that since I have spent considerable amounts of time reading this book this year, it's definitely worth recording it. Like 'Hey why did I not read much in February?' and this is one of the examples why. Either way I actually liked this textbook. Our previous textbooks were the infamous Genki I and Genki II, and those were good. But something about those books felt juvenile. It felt very good to move to a textbook where the info was less in English and was able to assume that you knew the basics already.",
        "pages": 259,
        "genre": "Textbook, Reference Work",
        "dateRead": "3/6/2024"
    },
    {
        "id": "",
        "cover": "book-journal-img/1709915922206-641dae2a-0618-401b-a503-16b6c43e603a_1.jpg",
        "title": "The Clock We Live On",
        "author": "Isaac Asimov",
        "rating": 4.0,
        "review": "When I was in middle school I had a terrible time finding books to read. For some reason this book stood out to me and it became one of the only books I actually read on my own volition in middle school. Anyway, for my birthday my roommates got me a first edition copy from 1959. I hadn't been able to locate a copy this whole time so this was my first time reading it since my compulsory education. Reading it again has made me realize that this book has influenced the way I think a lot even now, and the way I consider time and anthropology. Basically the book is about how we came to quantify and measure time in the way that we do. It's very interesting and I really enjoy knowing the justification for the names of the months, the second, time zones, etc. My only worry is how accurate is all of this? Over 60 years is a long time in a scientific discipline. Not to mention all other editions of this book aside from the first edition proudly display 'revised edition' on the front. If it was worthy of revision in the 60's why wouldn't it have inaccurate info now? The revised edition is so common in fact I had to scan the cover of the very same book I read to use as the picture for this post, usually I just grab the cover from the internet and make sure it matches up. I do recommend this book for people who would find interesting the origins of different time concepts. I enjoyed reading it again but I can identify some sticking points where it might become dull. Overall I gave it 4 stars because it is special to me, but I recognize it is not perfect and it isn't exactly riveting at times.",
        "pages": 172,
        "genre": "History, Reference Work",
        "dateRead": "3/8/2024"
    }

]